Revit 2027 API
ReinforcementSettings.RebarVaryingLengthNumberSuffix Property
 A unique identifier used for a bar within a variable length rebar set.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string RebarVaryingLengthNumberSuffix { get; set; }
Public Property RebarVaryingLengthNumberSuffix As String
	Get
	Set
public:
property String^ RebarVaryingLengthNumberSuffix {
	String^ get ();
	void set (String^ value);
}
member RebarVaryingLengthNumberSuffix : string with get, set
Property Value
String
Exceptions
Exception | Condition
ArgumentException |  When setting this property: The rebar number suffix is not valid if :
Input is empty.
Input contains non-alphanumeric characters.
Input contains both numeric and alphabetic characters.
Input is a value that exceeds the maximum integer representation.
Input contains more than 6 alphabetic characters.
ArgumentNullException |  When setting this property: A non-optional argument was null
Remarks
 This property is assigned to rebar sets with varying length bars only if they are numbered as a whole (i.e. [!:NumberVaryingLengthRebarsIndividually] is set to false).
 The values for this property are valid if :
Input contains at least one character.
Input contains either alphabetical or numeric characters (not both).
 When this property is used, each bar in a set with varying length bars will be assigned an incremented value of the suffix. As an example, the suffix values for three bars in a varying set are:
For alphabetic suffix : Aaz -> Aba -> Abb.
For numeric suffix : 129 -> 130 -> 131.
 These values are automatically incremented by the system.
See Also
Reference
ReinforcementSettings Class
Autodesk.Revit.DB.Structure Namespace